

# ","// F்


# ","// qஆ Wஈ
# ","// Eஊ Rஐ
# ","// Tஏ Yள
# ","// Uற Iன
# ","// Oட Pண
# ","// [ச ]ஞ
# ","// Aஅ Sஇ
# ","// Dஉ F்
# ","// Gஎ Hக
# ","// Jப Kம
# ","// Lத ;ந 'ய 
# ","// Zஔ Xஓ Cஒ Vவ Bங Nல Mர /ழ

# qஆ wஈ eஊ rஐ tஏ yள uற iன oட pண [ச ]ஞ aஅ sஇ dஉ f் gஎ hக jப kம lத ;ந 'ய \\ `` zஔ xஓ cஒ vவ bங nல mர ,, .. /ழ
# Qஸ Wஈ Eஊ Rஐ Tஏ Yள Uற Iன Oட Pண {ச }ஞ Aஅ Sஇ Dஉ F் Gஎ Hக Jப Kம Lத :ந "ய |\ ~` Zஔ Xஓ Cஒ Vவ Bங Nல Mர <, >. ?ழ
tab 	


vowels = ["ஃ","","அ","ஆ","இ","ஈ","உ","ஊ","எ","ஏ","ஐ","ஒ","ஓ","ஔ"]

vowel_sounds = ["","","a","ā","i","ī","u","ū","e","ē","ai","o","ō","au"]

syllables = [["க்","k","க","கா","கி","கீ","கு","கூ","கெ","கே","கை","கொ","கோ","கௌ"],
["ங்","ṅ","ங","ஙா","ஙி","ஙீ","ஙு","ஙூ","ஙெ","ஙே","ஙை","ஙொ","ஙோ","ஙௌ"],
["ச்","c","ச","சா","சி","சீ","சு","சூ","செ","சே","சை","சொ","சோ","சௌ"],
["ஞ்","ñ","ஞ","ஞா","ஞி","ஞீ","ஞு","ஞூ","ஞெ","ஞே","ஞை","ஞொ","ஞோ","ஞௌ"],
["ட்","ṭ","ட","டா","டி","டீ","டு","டூ","டெ","டே","டை","டொ","டோ","டௌ"],
["ண்","ṇ","ண","ணா","ணி","ணீ","ணு","ணூ","ணெ,,ணே","ணை","ணொ","ணோ","ணௌ"],
["த்","t","த","தா","தி","தீ","து","தூ","தெ","தே","தை","தொ","தோ","தௌ"],
["ந்","n","ந","நா","நி","நீ","நு","நூ","நெ","நே","நை","நொ","நோ","நௌ"],
["ப்","p","ப","பா","பி","பீ","பு","பூ","பெ","பே","பை","பொ","போ","பௌ"],
["ம்","m","ம","மா","மி","மீ","மு","மூ","மெ","மே","மை","மொ","மோ","மௌ"],
["ய்","y","ய","யா","யி","யீ","யு","யூ","யெ","யே","யை","யொ","யோ","யௌ"],
["ர்","r","ர","ரா","ரி","ரீ","ரு","ரூ","ரெ","ரே","ரை","ரொ","ரோ","ரௌ"],
["ல்","l","ல","லா","லி","லீ","லு","லூ","லெ","லே","லை","லொ","லோ","லௌ"],
["வ்","v","வ","வா","வி","வீ","வு","வூ","வெ","வே","வை","வொ","வோ","வௌ"],
["ழ்","ḻ","ழ","ழா","ழி","ழீ","ழு","ழூ","ழெ","ழே","ழை","ழொ","ழோ","ழௌ"],
["ள்","ḷ","ள","ளா","ளி","ளீ","ளு","ளூ","ளெ","ளே","ளை","ளொ","ளோ","ளௌ"],
["ற்","ṟ","ற","றா","றி","றீ","று","றூ","றெ","றே","றை","றொ","றோ","றௌ"],
["ன்","ṉ","ன","னா","னி","னீ","னு","னூ","னெ","னே","னை","னொ","னோ","னௌ"]
]

tamil_dict = {}
syllables.each do |s|
	sound = s[1]
	s = s[2..-1]
	s.each do |letter|
      	index = s.index(letter) + 2
      	english_syllable = sound+vowel_sounds[index]
      	tamil_syllable = letter
      	tamil_dict[english_syllable] = tamil_syllable
    end
end

